src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Кластеры</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает ссылку на ИБ кластера с заданным именем.
// Если ИБ не существует - создает её.
//
// Параметры:
//  Кластер - СправочникСсылка.Кластеры
//  ИмяИБ - Строка
//
// Возвращаемое значение:
//  СправочникСсылка.ИнформационныеБазы - Ссылка на существующую или созданную ИБ
//
Функция ПолучитьИлиСоздатьИБ(Кластер, ИмяИБ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИнформационныеБазы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	|ГДЕ
	|	ИнформационныеБазы.Владелец = &Кластер
	|	И ИнформационныеБазы.Имя = &ИмяИБ";
	Запрос.УстановитьПараметр("Кластер", Кластер);
	Запрос.УстановитьПараметр("ИмяИБ", ИмяИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		НоваяИБ = СоздатьЭлемент();
		НоваяИБ.Владелец = Кластер;
		НоваяИБ.Имя = ИмяИБ;
		НоваяИБ.Наименование = СтрШаблон("%1\%2", Строка(Кластер), ИмяИБ);
		НоваяИБ.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
		НоваяИБ.Записать();
		Возврат НоваяИБ.Ссылка;
	КонецЕсли;
КонецФункции

#КонецОбласти
 
#КонецЕсли
